# Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор. Функция должна вызываться следующим образом: for el in fact(n).
# Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые n чисел, начиная с 1! и до n!.

number = 5

def fact(num):
    a, i = 1, 1
    while i <= num:
        yield a
        a = a * (i + 1)
        i = i + 1
        # print(a, i, num)

for el in fact(number):
    print(el)
